import random
bag = {'С уроном':{},
    'Без урона': {},
    'Метательное': [],
}

a = [{'нож': [2,2,90]}]
b = [{'нож2': [3,3,90]}]
bag['Метательное'].append(a)
bag['Метательное'].append(b)
print(bag['Метательное'])

for i in range(len(bag['Метательное'])):
  s=''
  s = list(bag['Метательное'][i][0].keys())[0]
  print(s,end='')
  print(f': {bag["Метательное"][i][0][s][0]} - {bag["Метательное"][i][0][s][1]}')

x = int(input('Введите что вы хоитте метнуть'))
#u = list(bag["Метательное"][x-1][0].keys())[0]
#print(bag['Метательное'][x-1][0])
del bag['Метательное'][x-1]
print(bag['Метательное'])
#print(bag['Метательное'][0][0])