import random
items =            {'Старый меч': [1,4],
    'Старый кременевый питослет': [2,3],
                    'Старый лук': [0,6],
                    'Хлам':[5],
                    'Части пистолета':[7],
                    'Уголь':[3],
                    'Тряпку':[2],
                    'Проволку':[2],
                    'Механизм':[9],
                    'Ложку':[1],
                    'Тарелку':[1],
                    'Зелье здоровья':[15],
                    'Припарку':[15],
                    }
snaryajenie = {'Голова': 0,
              'Куртка': 0,
               'Обувь': 0,
                'Руки': [],
             'Кольцо1': 0,
             'Кольцо2': 0,
            'Ожерелье': 0,}
conteiners = ["Ящик","Бочка(у)","Деревянный Сундук","Комод","Тумба(у)","Ведро","Контрейнер","Шкаф"]
#enemy_str = ['Крыс','Волков','Гоблинов','Медведей','Гарпий','Слизня','Чупокабру']
items2 = ['','','','','','','','','','']



enemy = {'Крыс': [10,2],
       'Волков': [15,3],
     'Гоблинов': [12,3],
     'Медведей': [20,3],
       'Гарпий': [10,5],
       'Слизня': [4,4],
       }

bag = {'Оружие':[],
        'Предметы': [],
        'Метательное': [],
    }

def bag_osmotr(bag):
  print(bag)
  i=0
  for key in bag:
    if key == 'Предметы':
      if len(bag['Предметы']) != 0:
        for key2 in bag['Предметы'][0]: #изменить поиск по индексу массива а не по ключу
            print(f'\n{key2}')
    if key == 'Оружие':
      if len(bag['Оружие']) != 0:
        for key3,val in bag['Оружие'][0].items():
            print(f'\n{key3}  {val}') #доделать что в руках, а что в сумке
    if key == 'Метательное':
      if len(bag['Метательное']) != 0:
        for key4,val2 in bag['Метательное'][0].items():
            print(f'\n{key4}  {val2}')
  return input('\nДля выхода нажмите любую кнопку: ')
  
def items_in_bag(rand_items,bag):
  if len(list(rand_items.values())[0]) == 3:
    bag['Метательное'].append(rand_items)
  if len(list(rand_items.values())[0]) == 2:
    bag['Оружие'].append(rand_items)
  if len(list(rand_items.values())[0]) == 1:
    bag['Предметы'].append(rand_items)
  